Repository: BelfDev/homely
Catalog: frontend/homely/Homely/Resources/Strings/Shared.xcstrings
Source language: en
Languages: pt_br

# key:date_input_clear_accessibility
source: Clear date selection
pt_br: Limpar seleção de data

# key:date_input_placeholder
source: Select a date
pt_br: Selecione uma data

# key:error_bottom_sheet_button
source: Close
pt_br: Fechar

# key:error_bottom_sheet_title
source: Oops, something went wrong!
pt_br: Oops, algo não está certo!

# key:error_date_in_past
source: The selected date must be in the future.
pt_br: A data selecionada precisa ser no futuro.

# key:error_date_range_too_short
source: The date range must be at least %@ minutes long.
pt_br: O intervalo de datas selecionado precisa ser de pelo menos %@ minutos.

# key:error_empty_field
source: Please enter a value for this field.
pt_br: Por favor preencha esse campo.

# key:error_end_date_before_start_date
source: The end date must be after the start date.
pt_br: A data de encerramento deve ser após a data de início.

# key:error_generic
source: Something went wrong. Please try again later.
pt_br: Algo imprevisto aconteceu. Por favor tente novamente.

# key:error_invalid_credentials
source: Invalid credentials. Please check your email and password.
pt_br: Credencial inválido. Por favor confira se inseriu corretamente o seu email e senha.

# key:error_invalid_email
source: Please enter a valid email address.
pt_br: Por favor insira um email válido.

# key:error_invalid_name
source: Names must be between 2 and 64 non-special characters.
pt_br: Nomes devem ter entre 2 e 64 caracteres não especiais.

# key:error_request_timeout
source: The request timed out. Please try again.
pt_br: O tempo para completar essa operação expirou. Tente novamente em instantes.

# key:error_short_password
source: Password must be at least %d characters.
pt_br: Sua senha deve ter pelo menos %d caracteres.

# key:error_too_long_text
source: This field cannot exceed %d characters.
pt_br: Esse campo não pode exceder %d caracteres.

# key:first_name_input_label
source: First Name
pt_br: Nome

# key:last_name_input_label
source: Last Name
pt_br: Sobrenome

# key:password_input_label
source: Password
pt_br: Senha
